# Pivot Table and Melt Function

Melt()

In [42]:
import pandas as pd 
var = pd.DataFrame({"days":[1,1,1,1,2,2],
"st_name":["a","b","a","a","b","b"],"eng":[10,12,14,15,16,12],"maths":[17,18,19,13,14,16]})
var

   days st_name  eng  maths
0     1       a   10     17
1     1       b   12     18
2     1       a   14     19
3     1       a   15     13
4     2       b   16     14
5     2       b   12     16

In [43]:
pd.melt(var,id_vars=["days"],var_name="python",value_name="wscube")

    days   python wscube
0      1  st_name      a
1      1  st_name      b
2      1  st_name      a
3      1  st_name      a
4      2  st_name      b
5      2  st_name      b
6      1      eng     10
7      1      eng     12
8      1      eng     14
9      1      eng     15
10     2      eng     16
11     2      eng     12
12     1    maths     17
13     1    maths     18
14     1    maths     19
15     1    maths     13
16     2    maths     14
17     2    maths     16

In [44]:
# var.pivot(index="days",columns="st_name",values="eng")

In [45]:
var.pivot_table(index="st_name", columns="days", aggfunc="mean")

          eng            maths
days        1     2          1     2
st_name
a        13.0   NaN  16.333333   NaN
b        12.0  14.0  18.000000  15.0

In [47]:
var.pivot_table(index="st_name", columns="days", aggfunc="sum",margins="True")

          eng           maths
days        1     2 All     1     2 All
st_name
a        39.0   NaN  39  49.0   NaN  49
b        12.0  28.0  40  18.0  30.0  48
All      51.0  28.0  79  67.0  30.0  97